app/controllers/posts_controller.rb

SELECT `posts`.* FROM `posts` ORDER BY `posts`.`created_at` DESC
---
  def index
    #@posts = ["今日からProgateでRailsの勉強するよー！","投稿一覧ページ作成中！"]
    @posts = Post.all.order(created_at: :desc)