app/controllers/users_controller.rb

    def index
        @user = User.all.order(id: :desc)
---
SELECT `users`.* FROM `users` ORDER BY `users`.`id` DESC

    def create
        @user = User.new(
            name:params[:name],
            email:params[:email],
            image_name:"default_user.jpg",
            password: params[:password]
        )
        if @user.save
---
INSERT INTO `users` (`name`, `email`, `created_at`, `updated_at`, `image_name`, `password_digest`) VALUES ('ふぁえふぁえｆ', 'えふぁｆ', '2020-11-14 08:44:21', '2020-11-14 08:44:21', 'default_user.jpg', '$2a$12$bYWRjRzLSELBUp4VzBYYZ.jOieO5LbwS1/cRbpUWKAyAy7wBwze1.')